#+title: Readme
#+AUTHOR: chodkows

** WebAssembly function

#+begin_src bash :!tangle /home/chodkows/Git/rust/wa-snake/www/sum.wasm
(module
  (func $sum (param $a i32) (param $b i32) (result i32)
      local.get $a
      local.get $b
      i32.add
  )
  (export "sum" (func $sum))
)
#+end_src

Show assembly code from WAT code from above snippet:
#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake/www :results scalar
xxd -g1 -c8 sum.wasm
#+end_src

#+RESULTS:
#+begin_example
00000000: 28 6d 6f 64 75 6c 65 0a  (module.
00000008: 20 20 28 66 75 6e 63 20    (func
00000010: 24 73 75 6d 20 28 70 61  $sum (pa
00000018: 72 61 6d 20 24 61 20 69  ram $a i
00000020: 33 32 29 20 28 70 61 72  32) (par
00000028: 61 6d 20 24 62 20 69 33  am $b i3
00000030: 32 29 20 28 72 65 73 75  2) (resu
00000038: 6c 74 20 69 33 32 29 0a  lt i32).
00000040: 20 20 20 20 20 20 6c 6f        lo
00000048: 63 61 6c 2e 67 65 74 20  cal.get
00000050: 24 61 0a 20 20 20 20 20  $a.
00000058: 20 6c 6f 63 61 6c 2e 67   local.g
00000060: 65 74 20 24 62 0a 20 20  et $b.
00000068: 20 20 20 20 69 33 32 2e      i32.
00000070: 61 64 64 0a 20 20 29 0a  add.  ).
00000078: 20 20 28 65 78 70 6f 72    (expor
00000080: 74 20 22 73 75 6d 22 20  t "sum"
00000088: 28 66 75 6e 63 20 24 73  (func $s
00000090: 75 6d 29 29 0a 29 0a     um)).).
#+end_example


#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake/www :results scalar
for b in $(xxd -ps -c1 sum.wasm); do echo -n "0x$b, "; done
#+end_src

#+RESULTS:
: 0x28, 0x6d, 0x6f, 0x64, 0x75, 0x6c, 0x65, 0x0a, 0x20, 0x20, 0x28, 0x66, 0x75, 0x6e, 0x63, 0x20, 0x24, 0x73, 0x75, 0x6d, 0x20, 0x28, 0x70, 0x61, 0x72, 0x61, 0x6d, 0x20, 0x24, 0x61, 0x20, 0x69, 0x33, 0x32, 0x29, 0x20, 0x28, 0x70, 0x61, 0x72, 0x61, 0x6d, 0x20, 0x24, 0x62, 0x20, 0x69, 0x33, 0x32, 0x29, 0x20, 0x28, 0x72, 0x65, 0x73, 0x75, 0x6c, 0x74, 0x20, 0x69, 0x33, 0x32, 0x29, 0x0a, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x6c, 0x6f, 0x63, 0x61, 0x6c, 0x2e, 0x67, 0x65, 0x74, 0x20, 0x24, 0x61, 0x0a, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x6c, 0x6f, 0x63, 0x61, 0x6c, 0x2e, 0x67, 0x65, 0x74, 0x20, 0x24, 0x62, 0x0a, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x69, 0x33, 0x32, 0x2e, 0x61, 0x64, 0x64, 0x0a, 0x20, 0x20, 0x29, 0x0a, 0x20, 0x20, 0x28, 0x65, 0x78, 0x70, 0x6f, 0x72, 0x74, 0x20, 0x22, 0x73, 0x75, 0x6d, 0x22, 0x20, 0x28, 0x66, 0x75, 0x6e, 0x63, 0x20, 0x24, 0x73, 0x75, 0x6d, 0x29, 0x29, 0x0a, 0x29, 0x0a,

Check how many bites program have:
#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake/www :results scalar
stat sum.wasm
#+end_src

#+RESULTS:
:   File: sum.wasm
:   Size: 151       	Blocks: 8          IO Block: 4096   regular file
: Device: 259,2	Inode: 2883800     Links: 1
: Access: (0644/-rw-r--r--)  Uid: ( 1000/chodkows)   Gid: ( 1000/chodkows)
: Access: 2022-11-04 16:00:43.124359850 +0100
: Modify: 2022-11-04 16:00:43.124359850 +0100
: Change: 2022-11-04 16:00:43.124359850 +0100
:  Birth: 2022-11-04 16:00:43.124359850 +0100

Check WebAssembly code in web site
https://webassembly.github.io/wabt/demo/wat2wasm

** Run webassebly using webpack
#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake/www
npm init -y
npm install --save webpack webpack-cli webpack-dev-server
cat <<EOF > .gitignore
node_modules
EOF

#+end_src

#+RESULTS:
Move sum.wasm and index.html to public foler
#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake/www
mkdir public
mv sum2.wasm public/
mv index.html public/
#+end_src

#+RESULTS:

* Preparing the Game
#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake
cat << EOF > Cargo.toml
[package]
name = "wa-snake"
version = "0.1.0"
edition = "2021"

# See more keys and their definitions at https://doc.rust-lang.org/cargo/reference/manifest.html

[dependencies]
wasm-bindgen = "0.2.83"

[lib]
crate-type = ["cdylib"]

EOF
#+end_src

#+RESULTS:

*#[wasm_bindgen]* macro for sharing for JS
#+begin_src rust :tangle /home/chodkows/Git/rust/wa-snake/src/lib.rs
use wasm_bindgen::prelude::*;

#[wasm_bindgen]
pub fn great(name: &str) {
    println!("Hi there {}", name);
}
#+end_src

#+begin_src bash
cargo install wasm-pack
#+end_src

#+RESULTS:

#+begin_src bash
wasm-pack build --target web
#+end_src

#+RESULTS:
Add wasm dependency:
*"wa-snake": "file:../pkg"*
#+begin_src json :tangle /home/chodkows/Git/rust/wa-snake/www/package.json
{
  "name": "www",
  "version": "1.0.0",
  "main": "index.js",
  "scripts": {
    "test": "echo \"Error: no test specified\" && exit 1",
    "dev": "webpack-dev-server",
    "build": "webpack build"
  },
  "keywords": [],
  "author": "",
  "license": "ISC",
  "dependencies": {
    "copy-webpack-plugin": "^11.0.0",
    "webpack": "^5.74.0",
    "webpack-cli": "^4.10.0",
    "webpack-dev-server": "^4.11.1",
    "wa-snake": "file:../pkg"
  },
  "description": ""
}
#+end_src

#+begin_src bash :dir /home/chodkows/Git/rust/wa-snake/www :results scalar
npm install
#+end_src

#+RESULTS:
:
: up to date, audited 327 packages in 862ms
:
: 42 packages are looking for funding
:   run `npm fund` for details
:
: found 0 vulnerabilities

Init is exported as default. Greet is exported as function.
#+begin_src js :tangle ~/Git/rust/wa-snake/www/index.js
import init, { great } from "wa-snake";

async function start() {
  const wasm = await init();
  great("Wojtek");
  console.log("Hello");
}
start()
#+end_src

Alternative
#+begin_src js :!tangle ~/Git/rust/wa-snake/www/index.js
import init from "wa-snake";

async function start() {
  const wasm = await init();
  wasm.great("Wojtek");
  console.log("Hello");
}
start()
#+end_src


Alternative
#+begin_src js :!tangle ~/Git/rust/wa-snake/www/index.js
import init, { great } from "wa-snake";

init().then(wasm => {
  wasm.great("Wojtek");
  console.log("Hello");
})
#+end_src
